Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: The only universally recognized values for EXPR are C<0> for success and C<1> for error; other values are subject to interpretation depending on the environment in which the Perl program is running.
es_es: Los únicos valores universalmente reconocidos para EXPR son C<0> para éxito y C<1> para error; otros valores están sujetos a interpretación dependiendo del entorno en que el programa Perl está corriendo.

source: For example, exiting 69 (EX_UNAVAILABLE) from a I<sendmail> incoming-mail filter will cause the mailer to return the item undelivered, but that's not true everywhere.
es_es: Por ejemplo, saliendo con 69 (EX_UNAVAILABLE) desde un filtrado de un correo entrante hacia I<sendmail> hará que el despachador de correo devuelva el elemento sin entregar, pero no siempre es cierto.

source: Don't use C<exit> to abort a subroutine if there's any chance that someone might want to trap whatever error happened.
es_es: No use C<exit> para abortar una subrutina si existe la posibilidad de que alguien pueda capturar el error que ocurrió.

source: Use C<die> instead, which can be trapped by an C<eval>.
es_es: Use en su lugar C<die>, que puede ser atrapado por un C<eval>.

source: The exit() function does not always exit immediately.
es_es: La función exit() no siempre sale de forma inmediata.

source: It calls any defined C<END> routines first, but these C<END> routines may not themselves abort the exit.
es_es: exit() llama primero a cualquier rutina definida C<END>, pero estas rutinas C<END> pueden abortar la salida por sí mismas.

source: Likewise any object destructors that need to be called are called before the real exit.
es_es: Igualmente cualquier destructor de objetos que necesite ser llamado es llamado antes de la salida real.

source: If this is a problem, you can call C<POSIX:_exit($status)> to avoid END and destructor processing.
es_es: Si esto es un problema, puede llamar a C<POSIX:_exit($estado)> para saltar el procesado de END y de los destructores.

source: See L<perlmod> for details.
es_es: Ver L<perlmod> para los detalles.

source: =item exp EXPR X<exp> X<exponential> X<antilog> X<antilogarithm> X<e>
es_es: =item exp EXPR X<exp> X<exponencial> X<antilog> X<antilogaritmo> X<e>

source: Returns I<e> (the natural logarithm base) to the power of EXPR.
es_es: Devuelve I<e> (la base natural del logaritmo) a la potencia de EXPR.

source: If EXPR is omitted, gives C<exp($_)>.
es_es: Si EXPR se omite, devuelve C<exp($_)>.

source: =item fcntl FILEHANDLE,FUNCTION,SCALAR X<fcntl>
es_es: =item fcntl MANEJADOR,FUNCIÓN,ESCALAR X<fcntl>

source: Implements the fcntl(2) function.
es_es: Implementa la función fcntl(2).

source: You'll probably have to say
es_es: Probablemente escribirá

source: first to get the correct constant definitions.
es_es: primero para obtener las definiciones de las constantes.

source: Argument processing and value return works just like C<ioctl> below.
es_es: El procesado de argumentos y el valor devuelto funcionan como C<ioctl>.

source: For example:
es_es: Por ejemplo:

source: fcntl($filehandle, F_GETFL, $packed_return_buffer) or die "can't fcntl F_GETFL: $!";
es_es: fcntl($manejador, F_GETFL, $buffer_empaquetado_devuelto) or die "no puedo hacer fcntl F_GETFL: $!";

source: You don't have to check for C<defined> on the return from C<fcntl>.
es_es: No necesita comprobar con C<defined> al regreso de C<fcntl>.

source: Like C<ioctl>, it maps a C<0> return from the system call into C<"0 but true"> in Perl.
es_es: Como C<ioctl>, mapea un C<0> devuelto de la llamada del sistema en un C<"0 but true"> ("0 pero cierto") en Perl.

source: This string is true in boolean context and C<0> in numeric context.
es_es: Este string es verdadero en contexto booleano y C<0> en contexto numérico.

source: It is also exempt from the normal B<-w> warnings on improper numeric conversions.
es_es: También es una excepción en el sistema de avisos B<-w> sobre conversiones numéricas impropias.

source: Note that C<fcntl> will produce a fatal error if used on a machine that doesn't implement fcntl(2).
es_es: Note que C<fcntl> producirá un error fatal si se usa en una máquina que no implemente fcntl(2).

source: See the Fcntl module or your fcntl(2) manpage to learn what functions are available on your system.
es_es: Ver el módulo Fcntl o la página de manual fcntl(2) para aprender qué funciones están disponibles en su sistema.

source: Here's an example of setting a filehandle named C<REMOTE> to be non-blocking at the system level.
es_es: Aquí hay un ejemplo de poner un manejador de fichero llamado C<REMOTE> a no bloqueante a nivel de sistema.

source: You'll have to negotiate C<$|> on your own, though.
es_es: Aunque, tendrá que negociar también con C<$|>.

# or die "Can't get flags for the socket: $! ";
source: or die "Can't get flags for the socket: $!\n";
es_es: or die "No puedo obtener los flags para el socket: $!\n";

# or die "Can't set flags for the socket: $! ";
source: or die "Can't set flags for the socket: $!\n";
es_es: or die "No puedo poner los flags para el socket: $!\n";

source: =item fileno FILEHANDLE X<fileno>
es_es: =item fileno MANEJADOR X<fileno>

source: Returns the file descriptor for a filehandle, or undefined if the filehandle is not open.
es_es: Devuelve el descriptor de fichero para un manejador, o indefinido si el manejador no está abierto.

source: This is mainly useful for constructing bitmaps for C<select> and low-level POSIX tty-handling operations.
es_es: Esto es principalmente útil para construir bitmaps para C<select> y operaciones POSIX de bajo nivel sobre tty.

source: If FILEHANDLE is an expression, the value is taken as an indirect filehandle, generally its name.
es_es: Si el MANEJADOR es una expresión, el valor es tomado como un manejador indirecto, generalmente su nombre.

source: You can use this to find out whether two handles refer to the same underlying descriptor:
es_es: Puede usar esto para encontrar cuándo dos manejadores se refieren al mismo descriptor subyacente:

# if (fileno(THIS) == fileno(THAT)) { print "THIS and THAT are dups ";
source: if (fileno(THIS) == fileno(THAT)) { print "THIS and THAT are dups\n";
es_es: if (fileno(THIS) == fileno(THAT)) { print "THIS Y THAT son duplicados\n";

source: (Filehandles connected to memory objects via new features of C<open> may return undefined even though they are open.)
es_es: (Manejadores conectados a objetos en memoria vía las nuevas posibilidades de C<open> pueden devolver indefinido incluso si están abiertos).

source: =item flock FILEHANDLE,OPERATION X<flock> X<lock> X<locking>
es_es: =item flock MANEJADOR,OPERACIÓN X<flock> X<lock> X<bloqueo>

source: Calls flock(2), or an emulation of it, on FILEHANDLE.
es_es: Llama a flock(2), o una emulación de ella, sobre MANEJADOR.

source: Returns true for success, false on failure.
es_es: Devuelve verdadero para éxito, falso en fallo.

source: Produces a fatal error if used on a machine that doesn't implement flock(2), fcntl(2) locking, or lockf(3).
es_es: Produce un error fatal si se usa en una máquina que no implemente flock(2), bloqueo fcntl(2), o lockf(3).

source: C<flock> is Perl's portable file locking interface, although it locks only entire files, not records.
es_es: C<flock> es el interface portable de Perl de bloqueo de fichero, aunque sólo bloquea ficheros enteros, no registros.

source: Two potentially non-obvious but traditional C<flock> semantics are that it waits indefinitely until the lock is granted, and that its locks B<merely advisory>.
es_es: Dos potenciales no obvias pero tradicionales semánticas de C<flock> son que espera indefinidamente hasta que el bloqueo es efectivo, y que B<meramente es un consejo>.

source: Such discretionary locks are more flexible, but offer fewer guarantees.
es_es: Tales bloqueos discrecionalmente son más flexibles, pero ofrecen pocas garantías.

source: This means that programs that do not also use C<flock> may modify files locked with C<flock>.
es_es: Esto significa que los programas que no usen C<flock> pueden modificar ficheros bloqueados con C<flock>.

source: See L<perlport>, your port's specific documentation, or your system-specific local manpages for details.
es_es: Ver L<perlport>, la documentación específica de su adaptación Perl, o sus páginas de manual locales para los detalles.

source: It's best to assume traditional behavior if you're writing portable programs.
es_es: Es mejor asumir el comportamiento tradicional si está escribiendo programas portables.

source: (But if you're not, you should as always feel perfectly free to write for your own system's idiosyncrasies (sometimes called "features").
es_es: (Pero si no, puede siempre sentirse libre de escribir sus propias idiosincrasias del sistema (algunas veces llamadas "features" -características-).

source: Slavish adherence to portability concerns shouldn't get in the way of your getting your job done.)
es_es: Adhesión servil a los requerimientos de portabilidad no debe impedirle obtener el trabajo hecho).

source: OPERATION is one of LOCK_SH, LOCK_EX, or LOCK_UN, possibly combined with LOCK_NB.
es_es: OPERACIÓN es una de LOCK_SH, LOCK_EX, o LOCK_UN, posiblemente combinado con LOCK_NB.

source: These constants are traditionally valued 1, 2, 8 and 4, but you can use the symbolic names if you import them from the Fcntl module, either individually, or as a group using the ':flock' tag.
es_es: Estas constantes tienen, tradicionalmente, los valores 1, 2, 8 y 4, pero puede usar los nombres simbólicos si los importa con el módulo Fcntl, tanto de forma indivual o como un grupo usando la marca ':flock'.

source: LOCK_SH requests a shared lock, LOCK_EX requests an exclusive lock, and LOCK_UN releases a previously requested lock.
es_es: LOCK_SH solicita un bloqueo compartido, LOCK_EX solicita un bloqueo exclusivo y LOCK_UN devuelve un bloqueo solicitado previamente.

source: If LOCK_NB is bitwise-or'ed with LOCK_SH or LOCK_EX then C<flock> will return immediately rather than blocking waiting for the lock (check the return status to see if you got it).
es_es: Si LOCK_NB se combina a nivel de bit con 'or' con LOCK_SH o LOCK_EX entonces C<flock> regresará inmediatamente en vez de esperar por el bloqueo (compruebe el valor de estado devuelto para ver si lo ha conseguido).

source: To avoid the possibility of miscoordination, Perl now flushes FILEHANDLE before locking or unlocking it.
es_es: Para evitar la posibilidad de descoordinación, Perl ahora vacía el MANEJADOR antes de bloquearlo o desbloquearlo.

source: Note that the emulation built with lockf(3) doesn't provide shared locks, and it requires that FILEHANDLE be open with write intent.
es_es: Note que la emulación integrada con lockf(3) no provee de bloqueos compartidos y requiere que el MANEJADOR sea abierto con intención de escribir en el.

source: These are the semantics that lockf(3) implements.
es_es: Estas son las semánticas que lockf(3) implementa.

source: Most if not all systems implement lockf(3) in terms of fcntl(2) locking, though, so the differing semantics shouldn't bite too many people.
es_es: La mayor parte si no todos los sistemas implementan lockf(3) en términos de bloqueo con fcntl(2), aunque, las diferencias en la semántica no llame la atención a mucha gente.

source: Note that the fcntl(2) emulation of flock(3) requires that FILEHANDLE be open with read intent to use LOCK_SH and requires that it be open with write intent to use LOCK_EX.
es_es: Note que la emulación de fcntl(2) de flock(3) requiere que MANEJADOR sea abierto con intención de leer para usar LOCK_SH y requiere ser abierto con intención de escribir para usar LOCK_EX.

source: Note also that some versions of C<flock> cannot lock things over the network; you would need to use the more system-specific C<fcntl> for that.
es_es: Note también que algunas versiones de C<flock> no pueden bloquear cosas sobre la red; necesitará usar un C<fcntl> más específico del sistema para hacer esto.

source: If you like you can force Perl to ignore your system's flock(2) function, and so provide its own fcntl(2)-based emulation, by passing the switch C<-Ud_flock> to the F<Configure> program when you configure perl.
es_es: Si le gusta puede forzar a Perl a ignorar la función del sistema flock(2) y proveer de su propia emulación basada en fcntl(2), pasando la opción C<-Ud_flock> al programa F<Configure> cuando configure perl.

source: Here's a mailbox appender for BSD systems.
es_es: Esto es un agregador de correo para sistemas BSD.

source: use Fcntl ':flock'; # import LOCK_* constants
es_es: use Fcntl ':flock'; # importar constantes LOCK_*

source: sub lock { flock(MBOX,LOCK_EX); # and, in case someone appended # while we were waiting... seek(MBOX, 0, 2);
es_es: sub lock { flock(MBOX,LOCK_EX); # y, en el caso de que alguien agregase # mientras estábamos esperando... seek(MBOX, 0, 2);

source: open(MBOX, ">>/usr/spool/mail/$ENV{'USER'}") or die "Can't open mailbox: $!";
es_es: open(MBOX, ">>/usr/spool/mail/$ENV{'USER'}") or die "No puedo abrir el buzón: $!";

source: On systems that support a real flock(), locks are inherited across fork() calls, whereas those that must resort to the more capricious fcntl() function lose the locks, making it harder to write servers.
es_es: En sistemas que soportan un flock() real, los bloqueos se heredan por llamadas fork(), teniendo en cuenta que se recurrirá a la caprichosa función fcntl() que pierde los bloqueos, haciendo difícil escribir servidores.

source: See also L<DB_File> for other flock() examples.
es_es: Ver también L<DB_File> para otros ejemplos de flock().

source: =item fork X<fork> X<child> X<parent>
es_es: =item fork X<fork> X<hijo> X<padre>

source: Does a fork(2) system call to create a new process running the same program at the same point.
es_es: Hace una llamada del sistema fork(2) para crear un nuevo proceso ejecutando el mismo programa en el mismo punto.

source: It returns the child pid to the parent process, C<0> to the child process, or C<undef> if the fork is unsuccessful.
es_es: Devuelve el pid del hijo al proceso padre, C<0> al proceso hijo, o C<undef> si no se consiguió el fork.

source: File descriptors (and sometimes locks on those descriptors) are shared, while everything else is copied.
es_es: Descriptores de fichero (y algunas veces bloqueos en estos descriptores) son compartidos, mientras que todo lo demás es copiado.

source: On most systems supporting fork(), great care has gone into making it extremely efficient (for example, using copy-on-write technology on data pages), making it the dominant paradigm for multitasking over the last few decades.
es_es: En la mayoría de los sistemas que soportan fork(), se ha tenido gran cuidado en hacerlo extremadamente eficiente (por ejemplo, usando la tecnología copy-on-write en páginas de datos), haciendo de él el paradigma dominante de la multitarea en las últimas décadas.

source: Beginning with v5.6.0, Perl will attempt to flush all files opened for output before forking the child process, but this may not be supported on some platforms (see L<perlport>).
es_es: A partir de la versión v5.6.0, Perl intentará vaciar todos los ficheros abiertos para salida antes de crear un proceso hijo, pero esto puede no estar soportado en todas las plataformas (ver L<perlport>).

source: To be safe, you may need to set C<$|> ($AUTOFLUSH in English) or call the C<autoflush()> method of C<IO::Handle> on any open handles in order to avoid duplicate output.
es_es: Para asegurarse, puede poner C<$|> ($AUTOFLUSH en English) o llamar el método C<autoflush()> de C<IO::Handle> en cualquiera de los manejadores abiertos para evitar la duplicidad de datos en la salida.

source: If you C<fork> without ever waiting on your children, you will accumulate zombies.
es_es: Si usted hace un C<fork> sin luego esperar a sus hijos, irá acumulando zombies.

source: On some systems, you can avoid this by setting C<$SIG{CHLD}> to C<"IGNORE">.
es_es: En algunos sistemas, puede evitar esto poniendo C<$SIG{CHLD}> a C<"IGNORE">.

source: See also L<perlipc> for more examples of forking and reaping moribund children.
es_es: Ver también L<perlipc> para más ejemplos de fork y borrado de hijos moribundos.

source: Note that if your forked child inherits system file descriptors like STDIN and STDOUT that are actually connected by a pipe or socket, even if you exit, then the remote server (such as, say, a CGI script or a backgrounded job launched from a remote shell) won't think you're done.
es_es: Note que si su hijo hereda los descriptores de archivo del sistema como STDIN y STDOUT que estén conectados a un pipe o a un socket, incluso si usted sale del programa, el servidor remoto (por ejemplo, un script CGI o un proceso lanzado en background desde un shell remoto) no se dará cuenta de que se ha ido.

source: You should reopen those to F</dev/null> if it's any issue.
es_es: Deberá reabrirlos a F</dev/null> si eso es un problema.

source: Declare a picture format for use by the C<write> function.
es_es: Declara una imagen de formato para usar con la función C<write>.

source: format Something = Test: @<<<<<<<< @||||| @>>>>> $str, $%, '$' .
es_es: format Algo = Test: @<<<<<<<< @||||| @>>>>> $str, $%, '$' .

source: int($num)
es_es: int($numero)

source: $num = $cost/$quantity;
es_es: $numero = $coste/$cantidad;

source: $~ = 'Something';
es_es: $~ = 'Algo';

source: See L<perlform> for many details and examples.
es_es: Ver L<perlform> para más detalles y ejemplos.

source: =item formline PICTURE,LIST X<formline>
es_es: =item formline CUADRO,LISTA X<formline>

source: This is an internal function used by C<format>s, though you may call it, too.
es_es: Esta es una función interna usada por C<format>, aunque también puede llamarla.

source: It formats (see L<perlform>) a list of values according to the contents of PICTURE, placing the output into the format output accumulator, C<$^A> (or C<$ACCUMULATOR> in English).
es_es: Formatea (ver L<perlform>) una lista de valores de acuerdo a los contenidos de CUADRO, colocando la salida en el acumulador de salida de format, C<$^A> (o C<$ACCUMULATOR> en English).

source: Eventually, when a C<write> is done, the contents of C<$^A> are written to some filehandle.
es_es: Finalmente, cuando se hace un C<write>, los contenidos de C<$^A> se escriben al manejador de fichero.

source: You could also read C<$^A> and then set C<$^A> back to C<"">.
es_es: Puede también leer C<$^A> y volver a ponerla otra vez a C<"">.

source: Note that a format typically does one C<formline> per line of form, but the C<formline> function itself doesn't care how many newlines are embedded in the PICTURE.
es_es: Note que un formato típicamente hace un C<formline> por línea del formato, pero a la misma función C<formline> no le preocupa cuántos avances de línea están incluidos en el CUADRO.

source: This means that the C<~> and C<~~> tokens will treat the entire PICTURE as a single line.
es_es: Esto significa que los tokens C<~> y C<~~> tratarán al CUADRO entero como una única línea.

source: You may therefore need to use multiple formlines to implement a single record format, just like the format compiler.
es_es: Puede por eso necesitar usar múltiples formline para implementar un único registro format, como lo hace el propio format.

source: Be careful if you put double quotes around the picture, because an C<@> character may be taken to mean the beginning of an array name.
es_es: Tenga cuidado si pone dobles comillas alrededor del cuadro, porque un carácter C<@> puede ser tomado como el comienzo del nombre de un array.

source: C<formline> always returns true.
es_es: C<formline> siempre devuelve verdadero.

source: See L<perlform> for other examples.
es_es: Ver L<perlform> para otros ejemplos.

source: =item getc FILEHANDLE X<getc> X<getchar>
es_es: =item getc MANEJADOR X<getc> X<getchar>

source: Returns the next character from the input file attached to FILEHANDLE, or the undefined value at end of file, or if there was an error (in the latter case C<$!> is set).
es_es: Devuelve el siguiente carácter desde el fichero de entrada asociado a MANEJADOR, o el valor indefinido en el final de fichero, o si ocurrió un error (en este último caso, se actualiza C<$!>).

source: If FILEHANDLE is omitted, reads from STDIN.
es_es: Si MANEJADOR se omite, se lee desde STDIN.

source: This is not particularly efficient.
es_es: Esto no es particularmente eficiente.

source: However, it cannot be used by itself to fetch single characters without waiting for the user to hit enter.
es_es: Sin embargo, esto no puede ser usado para extraer caracteres sueltos sin esperar a que el usuario pulse la tecla de enter.

source: For that, try something more like:
es_es: Para esto, intente algo como esto:

source: $key = getc(STDIN);
es_es: $tecla = getc(STDIN);

source: Determination of whether $BSD_STYLE should be set is left as an exercise to the reader.
es_es: La determinación de cómo poner $BSD_STYLE se deja como ejercicio al lector.

source: The C<POSIX::getattr> function can do this more portably on systems purporting POSIX compliance.
es_es: La función C<POSIX::getattr> puede hacer esto de forma más portable en sistemas compatibles con POSIX.

source: See also the C<Term::ReadKey> module from your nearest CPAN site; details on CPAN can be found on L<perlmodlib/CPAN>.
es_es: Ver también el módulo C<Term::ReadKey> en su sitio CPAN más cercano; detalles sobre CPAN se pueden encontrar en L<perlmodlib/CPAN>.

source: This implements the C library function of the same name, which on most systems returns the current login from F</etc/utmp>, if any.
es_es: Implementa la función de la librería C del mismo nombre, que en la mayoría de los sistemas devuelve el login actual desde F</etc/utmp>, si existe.

source: If null, use C<getpwuid>.
es_es: Si nulo, use C<getpwuid>.

source: Do not consider C<getlogin> for authentication: it is not as secure as C<getpwuid>.
es_es: No considere usar C<getlogin> para autenticación: no es tan seguro como C<getpwuid>.

source: Returns the packed sockaddr address of other end of the SOCKET connection.
es_es: Devuelve la dirección sockect empaquetada del otro final de la conexión SOCKET.

source: $hersockaddr = getpeername(SOCK);
es_es: $sudireccion = getpeername(SOCK);

source: ($port, $iaddr) = sockaddr_in($hersockaddr);
es_es: ($puerto, $direccion) = sockaddr_in($sudireccion);

source: $herhostname = gethostbyaddr($iaddr, AF_INET);
es_es: $suhost = gethostbyaddr($direccion, AF_INET);

source: $herstraddr = inet_ntoa($iaddr);
es_es: $sunombre = inet_ntoa($direccion);

source: Returns the current process group for the specified PID.
es_es: Devuelve el actual grupo del proceso especificado por el PID.

source: Use a PID of C<0> to get the current process group for the current process.
es_es: Use un PID de C<0> para obtener el grupo del proceso actual.

source: Will raise an exception if used on a machine that doesn't implement getpgrp(2).
es_es: Elevará una excepción si se usa en una máquina que no implemente getpgrp(2).

source: If PID is omitted, returns process group of current process.
es_es: Si PID se omite, devuelve el grupo del proceso actual.

source: Note that the POSIX version of C<getpgrp> does not accept a PID argument, so only C<PID==0> is truly portable.
es_es: Note que la versión POSIX de C<getpgrp> no acepta un argumento PID, por lo que sólo C<PID==0> es verdaderamente portable.

source: =item getppid X<getppid> X<parent> X<pid>
es_es: =item getppid X<getppid> X<padre> X<pid>

source: Returns the process id of the parent process.
es_es: Devuelve el identificador de proceso del proceso padre.
